// T1136 - Search for new OAuth permissions in Google Workspace or Office 365
OfficeActivity
| where Operation == "ConsentToApplication"
| extend Scopes = parse_json(ExtendedProperties).Scopes
| where Scopes has_any ("full_access", "mail.read", "crm.data.read")
| project TimeGenerated, UserId, ClientAppId, Scopes, Operation
